templates/2.2.x/Base/0/include/general.in
    slipGroup
    {
        type        slip;
    }
