templates/2.2.x/Base/0/template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      FIELDNAME;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "${FOAM_CASE}/constant/boundaryConditions/basic";

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   $velocity.initial;

boundaryField
{
#   include "${WM_PROJECT_DIR}/etc/caseDicts/setConstraintTypes";

    defaultGroup { $:bc.default.FIELDNAME }

    inletGroup { $:bc.fixedInlet.FIELDNAME; }

    wallGroup { $:bc.walls.FIELDNAME; }

    slipGroup       { $:bc.slipWalls.FIELDNAME; }

    movingWallGroup { $:bc.movingWalls.FIELDNAME; }

    ambienceGroup { $:bc.totalPressure.FIELDNAME; }

    outflowGroup { $:bc.pressureOutlet.FIELDNAME; }

    farfieldGroup { $:bc.freestream.FIELDNAME; }

#   include "include/general.in";
}

// ************************************************************************* //
