templates/2.2.x/Base/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// * * * Scheme macro section  * * * * * * * * * * * * * * * * * * * * * * * //

Correction                  limited 0.33; // corrected;

// * * * End scheme macro section  * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;
}

divSchemes
{
    default             bounded Gauss upwind;
    div(phi,U)          bounded Gauss linearUpwind grad(U);
    div(phi,k)          bounded Gauss upwind;
    div(phi,epsilon)    bounded Gauss upwind;
    div(phi,omega)      bounded Gauss upwind;
    div(phi,nuTilda)    bounded Gauss upwind;
    div(R)              Gauss linear;
    div((nuEff*dev(T(grad(U)))))
                        Gauss linear;
}

laplacianSchemes
{
    default                 Gauss linear $Correction;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         $Correction;
}

fluxRequired
{
    default         no;
    p               ;
}


// ************************************************************************* //
