templates/2.2.x/Base/system/include/functionObjectIsoSurfaceI
    waterSurface
    {
        type            surfaces;
        functionObjectLibs ( "libsampling.so" );
        outputControl   timeStep;
        outputInterval  100;
        surfaceFormat   vtk;
        fields          ();
        interpolationScheme cellPoint;
        surfaces
        (
                 alpha 
                 {
                         type isoSurfaceCell;
                         isoField alpha1 ;
                         isoValue 0.5;
                         interpolate false ;
                         regularise true;
                 }
        );
    }

